public class ReverseString {
    public static void main(String[] args) {

        String origText = "Здравейте, казвам се Антоан Русинов и съм собственик на компания You Lead, " + "която е и издателство на бордови игри. " + "Към момента имаме три различни игри," + " както и три книги с предприемаческа насоченост." + " Продуктите ни целят да направят живота на клиентите ни по-забавен." + " Най-голямата ни сила е," + " че върху всяка една от игрите" + " можем да изработваме персонален фирмен брандинг," + " което прави продуктите ни много подходящи за корпоративни подаръци и събития." + " Тъй като се стремим към разширяване на пазарите си на международно ниво, " + "в момента търсим контакти с вериги книжарници в Европа и България. " + "Антоан Русинов, издателство на бордови игри. " + "Повече информация на сайта ни youlead.bg ";

        String reversedStringTwo = new StringBuilder(origText).reverse().toString();
        System.out.println("Втората обърната версия на текста " + origText + " е: ");
        System.out.println(reversedStringTwo);
    }
}